In [ ]:
import pandas as pd
import numpy as np
!pip install PyDrive
from pydrive.auth import GoogleAuth
from pydrive.drive import GoogleDrive
from google.colab import auth
from oauth2client.client import GoogleCredentials
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)
downloaded = drive.CreateFile({'id':"12qeAk6R21AYoOIHHT98bToMCX5ip2_Zx"})   # замените id на id своего файла
downloaded.GetContentFile('tr_types.csv')
downloaded = drive.CreateFile({'id':"1C6gCcxpYM8itP_uenvI8MAlkgvPhXgcq"})   # замените id на id своего файла
downloaded.GetContentFile('gender_train.csv')
downloaded = drive.CreateFile({'id':"1Cndag_y67-pQe7gMyb6PAjyV_9qXrOo1"})   # замените id на id своего файла
downloaded.GetContentFile('transactions.csv')
downloaded = drive.CreateFile({'id':"1PYSIDqMKOVFk-K4T-XJp2SUlisChMQy5"})   # замените id на id своего файла
downloaded.GetContentFile('tr_mcc_codes.csv')

Requirement already satisfied: PyDrive in /usr/local/lib/python3.6/dist-packages (1.3.1)
Requirement already satisfied: PyYAML>=3.0 in /usr/local/lib/python3.6/dist-packages (from PyDrive) (3.13)
Requirement already satisfied: oauth2client>=4.0.0 in /usr/local/lib/python3.6/dist-packages (from PyDrive) (4.1.3)
Requirement already satisfied: google-api-python-client>=1.2 in /usr/local/lib/python3.6/dist-packages (from PyDrive) (1.7.12)
Requirement already satisfied: httplib2>=0.9.1 in /usr/local/lib/python3.6/dist-packages (from oauth2client>=4.0.0->PyDrive) (0.17.4)
Requirement already satisfied: pyasn1>=0.1.7 in /usr/local/lib/python3.6/dist-packages (from oauth2client>=4.0.0->PyDrive) (0.4.8)
Requirement already satisfied: rsa>=3.1.4 in /usr/local/lib/python3.6/dist-packages (from oauth2client>=4.0.0->PyDrive) (4.6)
Requirement already satisfied: pyasn1-modules>=0.0.5 in /usr/local/lib/python3.6/dist-packages (from oauth2client>=4.0.0->PyDrive) (0.2.8)
Requirement already satisfied: six>=1.6.1 in /usr/local/lib/python3.6/dist-packages (from oauth2client>=4.0.0->PyDrive) (1.15.0)
Requirement already satisfied: google-auth-httplib2>=0.0.3 in /usr/local/lib/python3.6/dist-packages (from google-api-python-client>=1.2->PyDrive) (0.0.4)
Requirement already satisfied: google-auth>=1.4.1 in /usr/local/lib/python3.6/dist-packages (from google-api-python-client>=1.2->PyDrive) (1.17.2)
Requirement already satisfied: uritemplate<4dev,>=3.0.0 in /usr/local/lib/python3.6/dist-packages (from google-api-python-client>=1.2->PyDrive) (3.0.1)
Requirement already satisfied: cachetools<5.0,>=2.0.0 in /usr/local/lib/python3.6/dist-packages (from google-auth>=1.4.1->google-api-python-client>=1.2->PyDrive) (4.1.1)
Requirement already satisfied: setuptools>=40.3.0 in /usr/local/lib/python3.6/dist-packages (from google-auth>=1.4.1->google-api-python-client>=1.2->PyDrive) (50.3.0)

## Задание 0

Для всех  заданий будем использовать обезличенные транзакционные банковские данные. Для этого считайте в переменные **tr_mcc_codes, tr_types, transactions и gender_train** из одноимённых таблиц из папки data. Для таблицы transactions используйте только первые n=1000000 строк. Обратите внимание на разделители внутри каждого из файлов - они могут различаться!

###  Описание данных
#### Таблица ```transactions.csv```
##### Описание
Таблица содержит историю транзакций клиентов банка за один год и три месяца.

##### Формат данных

```
customer_id,tr_datetime,mcc_code,tr_type,amount,term_id
111111,15 01:40:52,1111,1000,-5224,111111
111112,15 15:18:32,3333,2000,-100,11122233
...
```
##### Описание полей

 - ```customer_id``` — идентификатор клиента;
 - ```tr_datetime``` — день и время совершения транзакции (дни нумеруются с начала данных);
 - ```mcc_code``` — mcc-код транзакции;
 - ```tr_type``` — тип транзакции;
 - ```amount``` — сумма транзакции в условных единицах со знаком; ```+``` — начисление средств клиенту (приходная транзакция), ```-``` — списание средств (расходная транзакция);
 - ```term_id``` — идентификатор терминала;


#### Таблица ```gender_train.csv```

##### Описание
Данная таблица содержит информацию по полу для части клиентов, для которых он известен. Для остальных клиентов пол неизвестен.

##### Формат данных
```
customer_id,gender
111111,0
111112,1
...
```

##### Описание полей
 - ```customer_id``` — идентификатор клиента;
 - ```gender``` — пол клиента;

### Таблица ```tr_mcc_codes.csv```

##### Описание
Данная таблица содержит описание mcc-кодов транзакций.

##### Формат данных
```
mcc_code;mcc_description
1000;словесное описание mcc-кода 1000
2000;словесное описание mcc-кода 2000
...
```

##### Описание полей
 - ```mcc_code``` – mcc-код транзакции;
 - ```mcc_description``` — описание mcc-кода транзакции.

#### Таблица ```tr_types.csv```

##### Описание
Данная таблица содержит описание типов транзакций.

##### Формат данных
```
tr_type;tr_description
1000;словесное описание типа транзакции 1000
2000;словесное описание типа транзакции 2000
...
```

##### Описание полей
 - ```tr_type``` – тип транзакции;
 - ```tr_description``` — описание типа транзакции;

Для всех заданий будем использовать обезличенные транзакционные банковские данные. Для этого считайте в переменные **tr_mcc_codes, tr_types, transactions и gender_train** из одноимённых таблиц из папки data. Для таблицы transactions используйте только первые n=1000000 строк. Обратите внимание на разделители внутри каждого из файлов - они могут различаться!

In [ ]:

tr_types = pd.read_csv(filepath_or_buffer = "tr_types.csv", sep = ';')
tr_types

     tr_type                                     tr_description
0       3200  Плата за предоставление услуг посредством моби...
1       3210  Плата за предоставление отчета по счету карты ...
2       3800  Плата за обслуживание банковской карты (за пер...
3       4000            Плата за получение наличных в Сбербанке
4       4001  Плата за получение наличных в Сбербанке (в дру...
..       ...                                                ...
150     2990                             Списание по требованию
151     2992  Списание средств для погашения задолженности п...
152     3001            Комиссия за обслуживание ссудного счета
153     3030  Плата за обслуживание банковской карты (за пос...
154     3120                Плата за досрочный перевыпуск карты

[155 rows x 2 columns]

In [ ]:
gender_train = pd.read_csv(filepath_or_buffer = "gender_train.csv", sep = ',')
gender_train

      customer_id  gender
0        10928546       1
1        69348468       1
2        61009479       0
3        74045822       0
4        27979606       1
...           ...     ...
8395     90417572       0
8396     66837341       0
8397     10758984       1
8398     11376556       0
8399     29190649       0

[8400 rows x 2 columns]

In [ ]:
transactions = pd.read_csv(filepath_or_buffer = "transactions.csv", nrows=1000000, sep = ',')
transactions

        customer_id   tr_datetime  mcc_code  tr_type    amount   term_id
0          39026145    0 10:23:26      4814     1030  -2245.92       NaN
1          39026145    1 10:19:29      6011     7010  56147.89       NaN
2          39026145    1 10:20:56      4829     2330 -56147.89       NaN
3          39026145    1 10:39:54      5499     1010  -1392.47       NaN
4          39026145    2 15:33:42      5499     1010   -920.83       NaN
...             ...           ...       ...      ...       ...       ...
999995     98801178  269 10:29:06      5921     1010 -23016.59    127873
999996     98801178  270 10:26:45      5211     1010 -61380.88  10114209
999997     98801178  270 15:18:53      5921     1010 -11800.27  10105341
999998     98801178  271 12:47:13      5211     1010 -16170.59  10114209
999999     98801178  271 14:51:56      5921     1010 -10025.77    123991

[1000000 rows x 6 columns]

In [ ]:
tr_mcc_codes = pd.read_csv(filepath_or_buffer = "tr_mcc_codes.csv", sep = ';')
tr_mcc_codes

     mcc_code                                    mcc_description
0         742                                Ветеринарные услуги
1        1711  Генеральные подрядчики по вентиляции, теплосна...
2        1731                        Подрядчики по электричеству
3        1799  Подрядчики, специализированная торговля — нигд...
4        2741           Разнообразные издательства/печатное дело
..        ...                                                ...
179      9211  Судовые выплаты, включая алименты и детскую по...
180      9222                                             Штрафы
181      9311                                  Налоговые платежи
182      9399  Правительственные услуги, нигде ранее не класс...
183      9402             Почтовые услуги — только правительство

[184 rows x 2 columns]

## Задание 1

1. Для столбца tr_type датафрейма transactions выберите произвольные 1000 строк с помощью метода sample
2. В полученной на предыдущем этапе подвыборке найдите долю транзакций (стобец tr_description в датасете tr_types), в которой содержится подстрока 'POS' или 'ATM'

In [ ]:
transactions_tr_type = transactions.sample(n = 1000)
table = pd.merge(transactions_tr_type, tr_types, on="tr_type")
transactions_tr_type =  table[table.tr_description.str.contains("POS|ATM")]
print()
print(sub_table.shape[0]/table.shape[0])
print(sub_table.size/table.size)
#y1*x/y2*x
transactions_tr_type.nlargest(1, 'amount')

0.414
0.414

     customer_id   tr_datetime  ...  term_id            tr_description
956     15729290  287 19:14:08  ...   657171  Взнос наличных через POS

[1 rows x 7 columns]

In [ ]:
transactions

        customer_id   tr_datetime  mcc_code  tr_type    amount   term_id
0          39026145    0 10:23:26      4814     1030  -2245.92       NaN
1          39026145    1 10:19:29      6011     7010  56147.89       NaN
2          39026145    1 10:20:56      4829     2330 -56147.89       NaN
3          39026145    1 10:39:54      5499     1010  -1392.47       NaN
4          39026145    2 15:33:42      5499     1010   -920.83       NaN
...             ...           ...       ...      ...       ...       ...
999995     98801178  269 10:29:06      5921     1010 -23016.59    127873
999996     98801178  270 10:26:45      5211     1010 -61380.88  10114209
999997     98801178  270 15:18:53      5921     1010 -11800.27  10105341
999998     98801178  271 12:47:13      5211     1010 -16170.59  10114209
999999     98801178  271 14:51:56      5921     1010 -10025.77    123991

[1000000 rows x 6 columns]

## Задание 2

1. Для столюца tr_type датафрейма transactions посчитайте частоту встречаемости всех типов транзакций tr_type в transactions.
2. Выведите топ-10 транзакций по частоте встречаемости.

In [ ]:
top = transactions.groupby('tr_type').size().sort_values(ascending=False).head(10)
topalt = transactions.groupby('tr_type').size().sort_values().tail(10)
print(top)
print(topalt)
ans = transactions.groupby(['tr_type', 'mcc_description']).size()
print(ans)

tr_type
1010    231117
2010    151166
7070    149006
1110    137658
1030    118975
2370     49830
7010     28972
7030     26078
7071     15781
1100     15476
dtype: int64
tr_type
1100     15476
7071     15781
7030     26078
7010     28972
2370     49830
1030    118975
1110    137658
7070    149006
2010    151166
1010    231117
dtype: int64
tr_type  mcc_description
1000     Места общественного питания, рестораны                                                           4
         Отели, мотели, базы отдыха, сервисы бронирования                                                 3
         Финансовые институты — снятие наличности вручную                                                 1
1010     Авиалинии, авиакомпании                                                                        482
         Авиалинии, авиакомпании, нигде более не классифицированные                                      64
                                                                                                       ...
8100     Бары, коктейль-бары, дискотеки, ночные клубы и таверны — места продажи алкогольных напитков      1
         Звонки с использованием телефонов, считывающих магнитную ленту                                   1
8145     Финансовые институты — снятие наличности автоматически                                           8
8146     Звонки с использованием телефонов, считывающих магнитную ленту                                   1
         Финансовые институты — снятие наличности автоматически                                           2
Length: 834, dtype: int64

## Задание 3
1. В датафрейме transactions найдите клиента с максимальной суммой приходов на карту
2. В датафрейме transactions найдите клиента с максимальной суммой расходов по карте
3. Найдите разницу для этих клиентов между суммой расходов и суммой приходов

In [ ]:
inc = transactions[transactions['amount'] > 0]
outc = transactions[transactions['amount'] < 0]
mostinc = inc.groupby('customer_id').sum()
mostoutc = outc.groupby('customer_id').sum()

In [ ]:
mostinc

             mcc_code  tr_type       amount
customer_id
115617           6011     7010    786070.52
117556         162296   189290   2379547.78
186730         240424   280925  17371260.17
189257         246430   288224  11695381.77
293048          54091    63500   3228503.93
...               ...      ...          ...
99859464        12020    14100    729922.63
99864691       102186   119190    577200.37
99900908        18033    21030    148230.44
99953525        96162   112470   1897798.84
99999680       300513   352113   6031990.79

[1725 rows x 3 columns]

In [ ]:
print("1 ", mostinc.idxmax())
print("2 ", mostoutc.idxmin()[2])
mostinc = mostinc.sort_values('amount', ascending=False).head(3)
mostoutc = mostoutc.sort_values('amount', ascending=True).head(3)
print("1 ", mostinc.index[0])
print("2 ", mostoutc.index[0])
print("3 ", mostinc['amount'].values[0] - abs(mostoutc['amount'].values[0]))

1  mcc_code    70780820
tr_type     70780820
amount      70780820
dtype: int64
2  70780820
1  70780820
2  70780820
3  -1837317.979973793

## Задание 4
1. Найдите среднее арифметическое и медиану по всем типам транзакций из топ 10 из задания 2
1. Найдите среднее арифметическое и медиану по всем типам транзакций для клиентов из задания 3

In [ ]:
print("1")
print("ср ариф: ", top.mean())
print("медиана: ", top.median())
print("2")
person1_trans = transactions[transactions.customer_id == mostinc.index[0]]
person1_trans_gr =  person1_trans.groupby('tr_type').size()
print("ср ариф: ", person1_trans_gr.mean())
print("медиана: ", person1_trans_gr.median())

1
ср ариф:  92405.9
медиана:  84402.5
2
ср ариф:  6829.307692307692
медиана:  156.0

## Подготовка для заданий 5-8

*Из заданий 5-8 нужно выполнить минимум два любых*

Соедините transactions с всеми остальными таблицами (tr_mcc_codes, tr_types, gender_train). Причём с gender_train необходимо смёрджиться с помощью left join, а с оставшимися датафреймами - через inner.
После получения результата таблицы gender_train, tr_types, tr_mcc_codes можно удалить. В результате соединения датафреймов должно получиться 999584 строки.

In [ ]:
transactions = pd.merge(transactions, gender_train, how='left')
transactions = pd.merge(transactions, tr_mcc_codes, how='inner')
transactions = pd.merge(transactions, tr_types, how='inner')
transactions.shape

(999584, 9)

In [ ]:
transactions

        customer_id  ...                  tr_description
0          39026145  ...  Оплата услуги. Банкоматы СБ РФ
1          39026145  ...  Оплата услуги. Банкоматы СБ РФ
2          39026145  ...  Оплата услуги. Банкоматы СБ РФ
3          39026145  ...  Оплата услуги. Банкоматы СБ РФ
4          39026145  ...  Оплата услуги. Банкоматы СБ РФ
...             ...  ...                             ...
999579     36837532  ...      Возврат  покупки. ТУ СБ РФ
999580      6808459  ...      Возврат  покупки. ТУ СБ РФ
999581     83759123  ...      Возврат  покупки. ТУ СБ РФ
999582     89619970  ...      Возврат  покупки. ТУ СБ РФ
999583     89619970  ...      Возврат  покупки. ТУ СБ РФ

[999584 rows x 9 columns]

## Задание 5

1. Определите модуль разницы между средними тратами женщин и мужчин (трата - отрицательное значение amount).
2. Определите модуль разницы между средними поступлениями у мужчин и женщин

Обратите внимание, что для вычисления модуля разности точных знаний о том, 
какой класc относится к мужчинам, а какой - к женщинам, не требуется.

In [ ]:
table5 = transactions[transactions['amount'] < 0]
#предположим 0 - это мужчина
males = table5[table5.gender == 0]['amount'].mean()
fmales = table5[table5.gender == 1]['amount'].mean()
print(males - fmales, "М")

table5_2 = transactions[transactions['amount'] > 0]
#предположим 0 - это мужчина
males2 = table5_2[table5_2.gender == 0]['amount'].mean()
fmales2 = table5_2[table5_2.gender == 1]['amount'].mean()
print(males2 - fmales2, "Ж")

32718.05492021877 М
63366.57104801515 Ж

## Задание 6

1. По всем типам транзакций рассчитайте максимальную сумму прихода на карту (из строго положительных сумм по столбцу amount) отдельно для мужчин и женщин (назовите ее "max_income"). Оставьте по 10 транзакций для мужчин и для женщин, наименьших среди всех транзакций по полученным значениям "max_income". 
2. Выделите среди них те, которые встречаются одновременно и у мужчин, и у женщин

In [ ]:
table6 = transactions[transactions['amount'] > 0]
#предположим 0 - это мужчина
males  = table6[table6['gender'] == 0]
fmales = table6[table6['gender'] == 1]
max_income_m = males.groupby('tr_type')['amount'].max().sort_values().head(10)
print("1")
print("males ", '\n', max_income_m)

max_income_f = fmales.groupby('tr_type')['amount'].max().sort_values().head(10)
print("fmales ", '\n', max_income_f)

both_g = pd.merge(max_income_m, max_income_f, on="tr_type") 
print("2")
print("both genders ", '\n',both_g)

1
males
 tr_type
4051     1122.96
4110     2245.92
4210     2245.92
2370     2335.75
4100     5041.86
7075     6737.75
2110    22459.16
1010    24839.83
2010    44918.32
2210    68315.82
Name: amount, dtype: float64
fmales
 tr_type
4110      2245.92
2020      2245.92
1010     28803.87
8100     64682.37
6000     79280.83
7041     87590.72
2010     89836.63
2110    112295.79
2370    113194.15
7015    121279.45
Name: amount, dtype: float64
2
both genders
          amount_x   amount_y
tr_type
4110      2245.92    2245.92
2370      2335.75  113194.15
2110     22459.16  112295.79
1010     24839.83   28803.87
2010     44918.32   89836.63

## Задание 7

1. Найдите суммы затрат по каждой категории для мужчин и для женщин. 
2. Найдите топ 5 категорий с самыми большими относительными модулями разности для в тратах для разных полов.

In [ ]:
table7 = transactions[transactions['amount'] < 0]
males  = table7[table7['gender'] == 0]
fmales = table7[table7['gender'] == 1]
sum_outc_m = males.groupby('mcc_code')['amount'].sum()
sum_outc_f = fmales.groupby('mcc_code')['amount'].sum()
print("1")
print("males ", '\n',sum_outc_m)
print("fmales ", '\n',sum_outc_f)
print("2")
both_g = pd.merge(sum_outc_m, sum_outc_f, on="mcc_code")
both_g['dif'] =abs(both_g['amount_x'] - both_g['amount_y'])
both_g = both_g.sort_values("dif", ascending=False).head(5)
print("top 5 diff ", '\n',both_g)

1
males
 mcc_code
742      -386207.68
1711     -674897.69
1799     -261626.73
2741      -20746.42
3000   -74431645.27
           ...
8699     -521107.48
8999   -19432057.92
9222     -361143.24
9311     -406197.45
9399    -1481389.65
Name: amount, Length: 174, dtype: float64
fmales
 mcc_code
742      -132277.93
1711     -206264.90
1731     -121542.67
1799    -1129257.68
2741     -221290.08
           ...
8999   -28643346.63
9222     -988205.17
9311     -373271.22
9399    -1810820.67
9402       -4581.67
Name: amount, Length: 175, dtype: float64
2
top 5 diff
               amount_x      amount_y           dif
mcc_code
6011     -4.958077e+09 -8.043939e+09  3.085862e+09
4829     -3.513864e+09 -6.013017e+09  2.499153e+09
6010     -2.612731e+08 -4.821311e+08  2.208580e+08
5541     -5.162489e+07 -2.070574e+08  1.554326e+08
5511     -5.095159e+06 -7.862393e+07  7.352877e+07

## Задание 8

1. Из поля tr_datetime выделите час tr_hour, в который произошла транзакция, как первые 2 цифры до ":". (\**)
2. Посчитайте ночные поступления для мужчин и женщин. Ночные - это примерно 00-06 часов.

In [ ]:
test= transactions['tr_hour'] = pd.to_numeric(transactions['tr_datetime'].str[-8:-6])
print(transactions['tr_datetime'])
#24 | 16777215 | 8

0           0 10:23:26
1           6 07:08:31
2           8 07:06:10
3          11 08:49:03
4          11 14:12:08
              ...
999579     18 23:38:60
999580    206 19:00:10
999581     90 22:40:57
999582    104 23:39:35
999583    105 23:38:49
Name: tr_datetime, Length: 999584, dtype: object

In [ ]:
table8 = transactions[transactions['amount']> 0][['gender', 'tr_datetime', 'amount']]
table8['tr_hour'] = pd.to_numeric(table8['tr_datetime'].str[-8:-6])
table8 = table8[(table8['tr_hour']>=0 ) & (table8['tr_hour']<=6)]
ans = table8.dropna().groupby('gender')['amount'].sum()
ansalt = table8.dropna().groupby('gender')['amount'].size()

In [ ]:
ans

gender
0.0    5.806437e+08
1.0    9.226917e+08
Name: amount, dtype: float64

In [ ]:
ansalt

gender
0.0     4059
1.0    32726
Name: amount, dtype: int64

In [ ]:
table8

        gender   tr_datetime     amount  tr_hour
119094     1.0   20 00:00:00   15721.41        0
119344     1.0   20 00:00:00   11229.58        0
120188     NaN  116 00:00:00    2245.92        0
120481     NaN  105 00:00:00   30544.45        0
120498     NaN  143 00:00:00   30836.42        0
...        ...           ...        ...      ...
998323     NaN  391 00:00:00  112295.79        0
998324     NaN  393 00:00:00   11229.58        0
998325     NaN  395 00:00:00  101066.21        0
998326     NaN  228 00:00:00    8759.07        0
998327     NaN   86 00:00:00   63829.82        0

[45045 rows x 4 columns]